{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Tim\Documents\Github\RwandaLAM\Dataout\02_stunting.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Aug 2016, 15:32:04
{txt}
{com}. 
. * Flag children selected for anthropmetry measures
. clonevar anthroTag = v042
{txt}
{com}. keep if anthroTag == 1
{txt}(3,969 observations deleted)

{com}. clonevar DHSCLUST = v001
{txt}
{com}. 
. clonevar stunting = hw5
{txt}(288 missing values generated)

{com}. clonevar stunting2 = hw70
{txt}(288 missing values generated)

{com}. 
. foreach x of varlist stunting stunting2 {c -(}
{txt}  2{com}.         replace `x' = . if inlist(`x', 9998, 9996)
{txt}  3{com}.         replace `x' = `x' / 100
{txt}  4{com}.         {c )-}
{txt}(75 real changes made, 75 to missing)
variable {bf}stunting{sf} was {bf}{res}int{sf}{txt} now {bf}{res}float{sf}
{txt}(3,518 real changes made)
(61 real changes made, 61 to missing)
variable {bf}stunting2{sf} was {bf}{res}int{sf}{txt} now {bf}{res}float{sf}
{txt}(3,533 real changes made)

{com}. *end
. 
. g byte stunted = (stunting < -2.0)
{txt}
{com}. replace stunted = . if stunting == .
{txt}(363 real changes made, 363 to missing)

{com}. 
. g byte stunted2 = (stunting2 < -2.0)
{txt}
{com}. replace stunted2 = . if stunting2 == .
{txt}(349 real changes made, 349 to missing)

{com}. 
. g byte extstunted = (stunting < -3.0)
{txt}
{com}. replace extstunted =. if stunting == .
{txt}(363 real changes made, 363 to missing)

{com}. 
. g byte extstunted2 = (stunting2 < -3.0)
{txt}
{com}. replace extstunted2 = . if stunting2 == .
{txt}(349 real changes made, 349 to missing)

{com}. 
. clonevar ageChild = hw1
{txt}(272 missing values generated)

{com}. clonevar age_group = v013
{txt}
{com}. 
. egen ageMonGroup = cut(ageChild), at(0, 6, 9, 12, 18, 24, 36, 48, 60) label
{txt}(272 missing values generated)

{com}. 
. recode b4 (1 = 0 "male")(2 = 1 "female"), gen(female)
{txt}(3887 differences between b4 and female)

{com}. 
. * Stunting averages grouping
. egen ageg_stunting = mean(stunting), by(age_group)
{txt}
{com}. egen age_stunting = mean(stunting), by(ageChild)
{txt}(272 missing values generated)

{com}. la var ageg_stunting "age group average for stunting"
{txt}
{com}. la var age_stunting "age chunk average for stunting"
{txt}
{com}. 
. * religion
. clonevar religion = v130
{txt}(1 missing value generated)

{com}. recode religion (4 5 7 96 = 4)
{txt}(religion: 47 changes made)

{com}. lab def rel 1 "catholic" 2 "protestant" 3 "adventist" 4 "other"
{txt}
{com}. la values religion rel
{txt}
{com}. 
. * health outcomes
. g byte diarrhea = (h11 == 2)
{txt}
{com}. 
. * Birth order and breastfeeding
. clonevar precedBI       = b11
{txt}(1,150 missing values generated)

{com}. clonevar succeedBI      = b12
{txt}(2,984 missing values generated)

{com}. clonevar birthOrder = bord
{txt}
{com}. clonevar dob            = b3
{txt}
{com}. clonevar ageFirstBirth = v212
{txt}
{com}. clonevar bfDuration     = m4
{txt}(11 missing values generated)

{com}. clonevar bfMonths       = m5
{txt}(11 missing values generated)

{com}. 
. recode s579 (0 8 = 0 "no")(1 = 1 "yes"), gen(childSick)
{txt}(2 differences between s579 and childSick)

{com}. clonevar deliveryPlace = m15
{txt}(1 missing value generated)

{com}. 
. clonevar birthWgt = m19
{txt}(3 missing values generated)

{com}. replace birthWgt = . if inlist(birthWgt, 9996, 9998, 9800)
{txt}(289 real changes made, 289 to missing)

{com}. replace birthWgt = birthWgt / 1000
{txt}variable {bf}birthWgt{sf} was {bf}{res}int{sf}{txt} now {bf}{res}float{sf}
{txt}(3,595 real changes made)

{com}. 
. clonevar birthWgtSource = m19a
{txt}
{com}. 
. * Keep elibigle children
. g eligChild = 0
{txt}
{com}. replace eligChild = 1 if (hw70 < 9996 & hw71 < 9996 & hw72 < 9996)
{txt}(3,538 real changes made)

{com}. g eligChild2 = 0
{txt}
{com}. replace eligChild2 =1 if (hw5 < 9996 & hw6 < 9996 & hw7 < 9996)
{txt}(3,044 real changes made)

{com}. 
. * How many children per household?
. bys caseid: g numChild = _N if eligChild == 1
{txt}(349 missing values generated)

{com}. 
. * Mother's bmi
. g bmitmp = (v445/100)
{txt}(12 missing values generated)

{com}. egen motherBMI = cut(bmitmp), at(0, 18.5, 25.0, 50) label
{txt}(12 missing values generated)

{com}. la def bmi 0 "undernourished" 1 "normal" 2 "overweight"
{txt}
{com}. la val motherBMI bmi
{txt}
{com}. 
. * Mother's education
. clonevar motherEd = v106
{txt}
{com}. clonevar motherEdYears = v107
{txt}(545 missing values generated)

{com}. 
. *************************
. *** Dietary Diversity ***
. *************************
. 
. d v41*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:v410           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V410     }{bind:  }{res}{res}gave child juice{p_end}
{p 0 48}{bind:v410a          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V410A    }{bind:  }{res}{res}na - gave child tea or coffee{p_end}
{p 0 48}{bind:v411           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V411     }{bind:  }{res}{res}gave child tinned, powdered or fresh milk{p_end}
{p 0 48}{bind:v411a          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V411A    }{bind:  }{res}{res}gave child baby formula{p_end}
{p 0 48}{bind:v412           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V412     }{bind:  }{res}{res}na - gave child fresh milk{p_end}
{p 0 48}{bind:v412a          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V412A    }{bind:  }{res}{res}gave child fortified baby food (cerelac, etc){p_end}
{p 0 48}{bind:v412b          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V412B    }{bind:  }{res}{res}na - gave child other porridge/gruel{p_end}
{p 0 48}{bind:v412c          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V412C    }{bind:  }{res}{res}gave child soup/clear broth{p_end}
{p 0 48}{bind:v413           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V413     }{bind:  }{res}{res}gave child other liquid{p_end}
{p 0 48}{bind:v413a          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V413A    }{bind:  }{res}{res}na - gave child cs liquid{p_end}
{p 0 48}{bind:v413b          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V413B    }{bind:  }{res}{res}na - gave child cs liquid{p_end}
{p 0 48}{bind:v413c          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V413C    }{bind:  }{res}{res}na - gave child cs liquid{p_end}
{p 0 48}{bind:v413d          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V413D    }{bind:  }{res}{res}na - gave child cs liquid{p_end}
{p 0 48}{bind:v414a          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414A    }{bind:  }{res}{res}na - gave child cs foods{p_end}
{p 0 48}{bind:v414b          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414B    }{bind:  }{res}{res}na - gave child cs foods{p_end}
{p 0 48}{bind:v414c          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414C    }{bind:  }{res}{res}na - gave child cs foods{p_end}
{p 0 48}{bind:v414d          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414D    }{bind:  }{res}{res}na - gave child cs foods{p_end}
{p 0 48}{bind:v414e          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414E    }{bind:  }{res}{res}gave child bread, noodles, other made from grains{p_end}
{p 0 48}{bind:v414f          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414F    }{bind:  }{res}{res}gave child potatoes, cassava, or other tubers{p_end}
{p 0 48}{bind:v414g          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414G    }{bind:  }{res}{res}gave child eggs{p_end}
{p 0 48}{bind:v414h          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414H    }{bind:  }{res}{res}gave child meat (beef, pork, lamb, chicken, etc){p_end}
{p 0 48}{bind:v414i          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414I    }{bind:  }{res}{res}gave child pumpkin, carrots, squash (yellow or orange inside){p_end}
{p 0 48}{bind:v414j          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414J    }{bind:  }{res}{res}gave child any dark green leafy vegetables{p_end}
{p 0 48}{bind:v414k          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414K    }{bind:  }{res}{res}gave child mangoes, papayas, other vitamin a fruits{p_end}
{p 0 48}{bind:v414l          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414L    }{bind:  }{res}{res}gave child any other fruits{p_end}
{p 0 48}{bind:v414m          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414M    }{bind:  }{res}{res}gave child liver, heart, other organs{p_end}
{p 0 48}{bind:v414n          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414N    }{bind:  }{res}{res}gave child fish or shellfish{p_end}
{p 0 48}{bind:v414o          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414O    }{bind:  }{res}{res}gave child food made from beans, peas, lentils, nuts{p_end}
{p 0 48}{bind:v414p          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414P    }{bind:  }{res}{res}gave child cheese, yogurt, other milk products{p_end}
{p 0 48}{bind:v414q          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414Q    }{bind:  }{res}{res}na - gave child oil, fats, butter, products made of them{p_end}
{p 0 48}{bind:v414r          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414R    }{bind:  }{res}{res}na - gave child chocolates, sweets, candies, pastries, etc{p_end}
{p 0 48}{bind:v414s          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414S    }{bind:  }{res}{res}gave child other solid-semisolid food{p_end}
{p 0 48}{bind:v414t          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414T    }{bind:  }{res}{res}na - gave child cs foods{p_end}
{p 0 48}{bind:v414u          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414U    }{bind:  }{res}{res}na - gave child cs foods{p_end}
{p 0 48}{bind:v414v          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414V    }{bind:  }{res}{res}gave child yogurt{p_end}
{p 0 48}{bind:v414w          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V414W    }{bind:  }{res}{res}na - gave child cs foods{p_end}
{p 0 48}{bind:v415           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V415     }{bind:  }{res}{res}drank from bottle with nipple yesterday/last night{p_end}
{p 0 48}{bind:v416           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V416     }{bind:  }{res}{res}heard of oral rehydration{p_end}
{p 0 48}{bind:v417           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}entries in maternity table{p_end}
{p 0 48}{bind:v418           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}entries in health table{p_end}
{p 0 48}{bind:v419           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}entries in height/weight table{p_end}
{txt}
{com}. /* NOTES: The recall is only for 24 hours so not sure how reliable
>                   the metric is. Will calculate but may be misleading.
>                   */
. 
. /* Calculate WDDS
> The categories are: 1. Starchy staples (WDDS_starch) 
>                     2. Dark green leafy vegetables (WDDS_veg_green) 
>                     3. Other Vitamin A rich fruit and veg (WDDS_vitA)
>                     4. Other fruit and veg (WDDS_veg_other)
>                     5. Organ meat (WDDS_organ)
>                     6. Meat and fish (WDDS_meat_fish)
>                     7. Eggs (WDDS_eggs)
>                     8. Legumes, nuts, and seeds (WDDS_legumes)  
>                     9. Milk and milk products (WDDS_dairy)
> */
. 
. * Starch <- v414f, v414e
. g byte starch = inlist(1, v414f, v414e) if !missing(v414f) | !missing(v414e)
{txt}(1,640 missing values generated)

{com}. 
. * Dark green veggies <- v414j
. g byte vegGreen = inlist(1, v414j) if !missing(v414j)
{txt}(1,642 missing values generated)

{com}. 
. * Vitamin A fruit and veg
. g byte vitA             = inlist(1, v414k, v414i) if !missing(v414k) | !missing(v414i)
{txt}(1,640 missing values generated)

{com}. 
. * other fruit and veg
. g byte othFruit = inlist(1, v414l) if !missing(v414l)
{txt}(1,640 missing values generated)

{com}. 
. * Organ meat
. g byte organ = inlist(1, v414m) if !missing(v414m)
{txt}(1,643 missing values generated)

{com}. 
. * fish and meat
. g byte meat = inlist(1, v414n, v414h) if !missing(v414n) | !missing(v414h)
{txt}(1,640 missing values generated)

{com}. 
. * eggs
. g byte eggs = inlist(1, v414g) if !missing(v414g)
{txt}(1,641 missing values generated)

{com}. 
. * Legumes, nuts and seeds
. g byte legumes = inlist(1, v414o) if !missing(v414o)
{txt}(1,640 missing values generated)

{com}. 
. * Milk and related
. g byte milk = inlist(1, v414p, v411, v414v) if !missing(v414p) | !missing(v411) | !missing(v414v)
{txt}(1,640 missing values generated)

{com}. 
. sum starch - milk

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}starch {c |}{res}      2,247    .5220294    .4996257          0          1
{txt}{space 4}vegGreen {c |}{res}      2,245    .4498886    .4975933          0          1
{txt}{space 8}vitA {c |}{res}      2,247    .2732532     .445729          0          1
{txt}{space 4}othFruit {c |}{res}      2,247    .1891411    .3917078          0          1
{txt}{space 7}organ {c |}{res}      2,244    .0138146    .1167469          0          1
{txt}{hline 13}{c +}{hline 57}
{space 8}meat {c |}{res}      2,247    .1197152    .3247004          0          1
{txt}{space 8}eggs {c |}{res}      2,246    .0284951    .1664195          0          1
{txt}{space 5}legumes {c |}{res}      2,247    .4886515    .4999825          0          1
{txt}{space 8}milk {c |}{res}      2,247    .1686693     .374543          0          1
{txt}
{com}. * Create dietary diversity
. egen dietdiv = rowtotal(starch vegGreen vitA othFruit organ meat eggs legumes milk)
{txt}
{com}. 
. * Keep subset of variables
. #delimit ;
{txt}delimiter now ;
{com}. ds(stunting stunting2 stunted stunted2 ageChild 
>         age_group female ageg_stunting age_stunting 
>         religion diarrhea precedBI succeedBI 
>         birthOrder dob ageFirstBirth bfDuration 
>         bfMonths childSick deliveryPlace birthWgt 
>         birthWgtSource v001 v002 eligChild
>         ageMonGroup starch vegGreen vitA 
>         othFruit organ meat eggs legumes milk
>         dietdiv bmitmp motherBMI motherEd 
>         motherEdYears DHSCLUST);
{txt}{col 1}stunting{col 15}stunted2{col 29}female{col 43}religion{col 57}succeedBI{col 71}ageFirstBi~h{col 85}childSick{col 99}birthWgtSo~e{col 113}eligChild{col 127}vegGreen{col 141}organ{col 155}legumes{col 169}bmitmp{col 183}motherEdYe~s
{col 1}stunting2{col 15}ageChild{col 29}ageg_stunt~g{col 43}diarrhea{col 57}birthOrder{col 71}bfDuration{col 85}deliveryPl~e{col 99}v001{col 113}ageMonGroup{col 127}vitA{col 141}meat{col 155}milk{col 169}motherBMI{col 183}DHSCLUST
{col 1}stunted{col 15}age_group{col 29}age_stunting{col 43}precedBI{col 57}dob{col 71}bfMonths{col 85}birthWgt{col 99}v002{col 113}starch{col 127}othFruit{col 141}eggs{col 155}dietdiv{col 169}motherEd

{com}. #delimit cr
{txt}delimiter now cr
{com}. keep `r(varlist)'
{txt}
{com}. 
. compress
  {txt}variable {bf}ageMonGroup{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}eligChild{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}motherBMI{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}dietdiv{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (46,644 bytes saved)

{com}. saveold "$pathout/DHS_child.dta", replace
{txt}(saving in Stata 13 format)
{p 0 6 2}
(FYI, {bf:saveold} has options
{bf:version(12)} and {bf:version(11)} that
write files in older Stata formats)
{p_end}
file C:\Users\Tim\Documents\Github\RwandaLAM/Dataout/DHS_child.dta saved

{com}. 
. * Merge in household information and livelihood information
. merge m:1 v001 v002 using "$pathout/DHS_hhvar.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           9,825
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}           9,825{txt}  (_merge==2)

{col 5}matched{col 30}{res}           3,887{txt}  (_merge==3)
{col 5}{hline 41}

{com}. ren DHSCLUST, lower
{res}{txt}
{com}. 
. merge m:1 dhsclust using "$pathout/RWA_DHS_Livelihoods.dta", gen(_dhs_FEWS)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           9,825
{txt}{col 9}from master{col 30}{res}           9,825{txt}  (_dhs_FEWS==1)
{col 9}from using{col 30}{res}               0{txt}  (_dhs_FEWS==2)

{col 5}matched{col 30}{res}           3,887{txt}  (_dhs_FEWS==3)
{col 5}{hline 41}

{com}. 
. * Label the cmc codes (di 12*(2014 - 1900)+1)
. la def cmc 1378 "Oct. 2014" 1379 "Nov. 2014" 1380 "Dec. 2014" 1381 "Jan. 2015" /*
> */ 1382 "Feb. 2015" 1383 "Mar. 2015" 1384 "Apr. 2015"
{txt}
{com}. la val intdate cmc
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Tim\AppData\Local\Temp\STD02000000.tmp"
{txt}
{com}. svy:mean stunted2, over(intdate)
{err}data not set up for svy, use {helpb svyset##|_new:svyset}
{txt}{search r(119), local:r(119);}

end of do-file

{search r(119), local:r(119);}

{com}. do "C:\Users\Tim\AppData\Local\Temp\STD02000000.tmp"
{txt}
{com}. svyset psu [pw = hhweight], strata(strata)

      {txt}pweight:{col 16}{res}hhweight
          {txt}VCE:{col 16}{res}linearized
  {txt}Single unit:{col 16}{res}missing
     {txt}Strata 1:{col 16}{res}strata
         {txt}SU 1:{col 16}{res}psu
        {txt}FPC 1:{col 16}<zero>
{p2colreset}{...}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\Tim\AppData\Local\Temp\STD02000000.tmp"
{txt}
{com}. svy:mean stunted2, over(intdate)
{txt}(running mean on estimation sample)
{res}
{txt}Survey: Mean estimation

{col 1}Number of strata{col 18}= {res}     60{txt}{col 35}Number of obs{col 51}= {res}     3,538
{txt}{col 1}Number of PSUs{col 18}= {res}    491{txt}{col 35}Population size{col 51}={res} 3,567.6914
{txt}{col 35}Design df{col 51}= {res}       431

    {txt}_subpop_1: intdate = {res}1369
    {txt}_subpop_2: intdate = {res}Nov. 2014
    {txt}_subpop_3: intdate = {res}Dec. 2014
    {txt}_subpop_4: intdate = {res}Jan. 2015
    {txt}_subpop_5: intdate = {res}Feb. 2015
    {txt}_subpop_6: intdate = {res}Mar. 2015
    {txt}_subpop_7: intdate = {res}Apr. 2015

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 26}  Linearized
{col 1}        Over{col 14}{c |}       Mean{col 26}   Std. Err.{col 38}     [95% Con{col 51}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{res}stunted2     {txt}{c |}
{space 3}_subpop_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 3}_subpop_2 {c |}{col 14}{res}{space 2} .4314242{col 26}{space 2} .0233374{col 37}{space 5}  .385555{col 51}{space 3} .4772934
{txt}{space 3}_subpop_3 {c |}{col 14}{res}{space 2} .4051743{col 26}{space 2} .0224582{col 37}{space 5} .3610331{col 51}{space 3} .4493154
{txt}{space 3}_subpop_4 {c |}{col 14}{res}{space 2} .3689373{col 26}{space 2} .0183517{col 37}{space 5} .3328673{col 51}{space 3} .4050073
{txt}{space 3}_subpop_5 {c |}{col 14}{res}{space 2} .3429427{col 26}{space 2} .0227569{col 37}{space 5} .2982145{col 51}{space 3}  .387671
{txt}{space 3}_subpop_6 {c |}{col 14}{res}{space 2} .3596948{col 26}{space 2} .0194941{col 37}{space 5} .3213795{col 51}{space 3}   .39801
{txt}{space 3}_subpop_7 {c |}{col 14}{res}{space 2} .2545833{col 26}{space 2} .0885542{col 37}{space 5} .0805315{col 51}{space 3}  .428635
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\Tim\AppData\Local\Temp\STD02000000.tmp"
{txt}
{com}. svy:mean stunted2, over(intdate)
{txt}(running mean on estimation sample)
{res}
{txt}Survey: Mean estimation

{col 1}Number of strata{col 18}= {res}     60{txt}{col 35}Number of obs{col 51}= {res}     3,538
{txt}{col 1}Number of PSUs{col 18}= {res}    491{txt}{col 35}Population size{col 51}={res} 3,567.6914
{txt}{col 35}Design df{col 51}= {res}       431

    {txt}_subpop_1: intdate = {res}1369
    {txt}_subpop_2: intdate = {res}Nov. 2014
    {txt}_subpop_3: intdate = {res}Dec. 2014
    {txt}_subpop_4: intdate = {res}Jan. 2015
    {txt}_subpop_5: intdate = {res}Feb. 2015
    {txt}_subpop_6: intdate = {res}Mar. 2015
    {txt}_subpop_7: intdate = {res}Apr. 2015

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 26}  Linearized
{col 1}        Over{col 14}{c |}       Mean{col 26}   Std. Err.{col 38}     [95% Con{col 51}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{res}stunted2     {txt}{c |}
{space 3}_subpop_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 3}_subpop_2 {c |}{col 14}{res}{space 2} .4314242{col 26}{space 2} .0233374{col 37}{space 5}  .385555{col 51}{space 3} .4772934
{txt}{space 3}_subpop_3 {c |}{col 14}{res}{space 2} .4051743{col 26}{space 2} .0224582{col 37}{space 5} .3610331{col 51}{space 3} .4493154
{txt}{space 3}_subpop_4 {c |}{col 14}{res}{space 2} .3689373{col 26}{space 2} .0183517{col 37}{space 5} .3328673{col 51}{space 3} .4050073
{txt}{space 3}_subpop_5 {c |}{col 14}{res}{space 2} .3429427{col 26}{space 2} .0227569{col 37}{space 5} .2982145{col 51}{space 3}  .387671
{txt}{space 3}_subpop_6 {c |}{col 14}{res}{space 2} .3596948{col 26}{space 2} .0194941{col 37}{space 5} .3213795{col 51}{space 3}   .39801
{txt}{space 3}_subpop_7 {c |}{col 14}{res}{space 2} .2545833{col 26}{space 2} .0885542{col 37}{space 5} .0805315{col 51}{space 3}  .428635
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. matrix plot = r(table)'
{txt}
{com}. matsort plot 1 "down"
{txt}
{com}. matrix plot = plot'
{txt}
{com}. coefplot (matrix(plot[1,])), ci((plot[5,] plot[6,]))
{res}{txt}(plot: CI1 missing for some coefficients)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. graph export "C:\Users\Tim\Documents\GitHub\RwandaLAM\Plots\raw\stunting_by_intdate.pdf", as(pdf) replace
{txt}(file C:\Users\Tim\Documents\GitHub\RwandaLAM\Plots\raw\stunting_by_intdate.pdf written in PDF format)

{com}. tab intdate

    {txt}date of {c |}
  interview {c |}
      (cmc) {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       1369 {c |}{res}         11        0.08        0.08
{txt}       1371 {c |}{res}          2        0.01        0.09
{txt}  Oct. 2014 {c |}{res}          1        0.01        0.10
{txt}  Nov. 2014 {c |}{res}      2,020       14.73       14.83
{txt}  Dec. 2014 {c |}{res}      3,065       22.35       37.19
{txt}  Jan. 2015 {c |}{res}      3,166       23.09       60.28
{txt}  Feb. 2015 {c |}{res}      2,426       17.69       77.97
{txt}  Mar. 2015 {c |}{res}      2,924       21.32       99.29
{txt}  Apr. 2015 {c |}{res}         97        0.71      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,712      100.00

{com}. tab intdate if eligChild

    {txt}date of {c |}
  interview {c |}
      (cmc) {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       1369 {c |}{res}         11        0.08        0.08
{txt}       1371 {c |}{res}          2        0.01        0.10
{txt}  Oct. 2014 {c |}{res}          1        0.01        0.10
{txt}  Nov. 2014 {c |}{res}      1,959       14.66       14.76
{txt}  Dec. 2014 {c |}{res}      2,982       22.32       37.08
{txt}  Jan. 2015 {c |}{res}      3,106       23.24       60.32
{txt}  Feb. 2015 {c |}{res}      2,359       17.65       77.98
{txt}  Mar. 2015 {c |}{res}      2,853       21.35       99.33
{txt}  Apr. 2015 {c |}{res}         90        0.67      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,363      100.00

{com}. tab intdate if eligChild==1

    {txt}date of {c |}
  interview {c |}
      (cmc) {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       1369 {c |}{res}          2        0.06        0.06
{txt}  Nov. 2014 {c |}{res}        498       14.08       14.13
{txt}  Dec. 2014 {c |}{res}        753       21.28       35.42
{txt}  Jan. 2015 {c |}{res}        881       24.90       60.32
{txt}  Feb. 2015 {c |}{res}        654       18.49       78.80
{txt}  Mar. 2015 {c |}{res}        721       20.38       99.18
{txt}  Apr. 2015 {c |}{res}         29        0.82      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,538      100.00

{com}. pwmean stunted2, over(intdate) pveffects mcompare(tukey)

{txt}Pairwise comparisons of means with equal variances

{txt}{p2colset 1 14 16 2}{...}
{p2col:over}:{space 1}{res:intdate}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 13}
{col 14}{c |}    Number of
{col 14}{c |}  Comparisons
{hline 13}{c +}{hline 13}
{space 5}intdate {c |}{col 14}{res}{space 1}          21
{txt}{hline 13}{c BT}{hline 13}

{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}
{col 25}{c |}{col 48}        T{col 57}ukey
{col 1}               stunted2{col 25}{c |}   Contrast{col 37}   Std. Err.{col 49}      t{col 57}   P>|t|
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}
{space 16}intdate {c |}
{space 5}Nov. 2014 vs 1369  {c |}{col 25}{res}{space 2} .4277108{col 37}{space 2} .3423738{col 48}{space 1}    1.25{col 57}{space 3}0.875
{txt}{space 5}Dec. 2014 vs 1369  {c |}{col 25}{res}{space 2} .4063745{col 37}{space 2} .3421418{col 48}{space 1}    1.19{col 57}{space 3}0.899
{txt}{space 5}Jan. 2015 vs 1369  {c |}{col 25}{res}{space 2} .3609535{col 37}{space 2}  .342076{col 48}{space 1}    1.06{col 57}{space 3}0.941
{txt}{space 5}Feb. 2015 vs 1369  {c |}{col 25}{res}{space 2} .3455657{col 37}{space 2} .3422104{col 48}{space 1}    1.01{col 57}{space 3}0.952
{txt}{space 5}Mar. 2015 vs 1369  {c |}{col 25}{res}{space 2} .3522885{col 37}{space 2} .3421619{col 48}{space 1}    1.03{col 57}{space 3}0.947
{txt}{space 5}Apr. 2015 vs 1369  {c |}{col 25}{res}{space 2} .2413793{col 37}{space 2} .3532743{col 48}{space 1}    0.68{col 57}{space 3}0.994
{txt}Dec. 2014 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.0213363{col 37}{space 2} .0279101{col 48}{space 1}   -0.76{col 57}{space 3}0.988
{txt}Jan. 2015 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.0667574{col 37}{space 2}  .027091{col 48}{space 1}   -2.46{col 57}{space 3}0.173
{txt}Feb. 2015 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.0821451{col 37}{space 2} .0287387{col 48}{space 1}   -2.86{col 57}{space 3}0.065
{txt}Mar. 2015 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.0754224{col 37}{space 2} .0281556{col 48}{space 1}   -2.68{col 57}{space 3}0.104
{txt}Apr. 2015 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.1863315{col 37}{space 2} .0923075{col 48}{space 1}   -2.02{col 57}{space 3}0.403
{txt}Jan. 2015 vs Dec. 2014  {c |}{col 25}{res}{space 2} -.045421{col 37}{space 2}  .023982{col 48}{space 1}   -1.89{col 57}{space 3}0.484
{txt}Feb. 2015 vs Dec. 2014  {c |}{col 25}{res}{space 2}-.0608088{col 37}{space 2} .0258289{col 48}{space 1}   -2.35{col 57}{space 3}0.219
{txt}Mar. 2015 vs Dec. 2014  {c |}{col 25}{res}{space 2} -.054086{col 37}{space 2} .0251784{col 48}{space 1}   -2.15{col 57}{space 3}0.325
{txt}Apr. 2015 vs Dec. 2014  {c |}{col 25}{res}{space 2}-.1649952{col 37}{space 2} .0914433{col 48}{space 1}   -1.80{col 57}{space 3}0.545
{txt}Feb. 2015 vs Jan. 2015  {c |}{col 25}{res}{space 2}-.0153877{col 37}{space 2} .0249415{col 48}{space 1}   -0.62{col 57}{space 3}0.996
{txt}Mar. 2015 vs Jan. 2015  {c |}{col 25}{res}{space 2} -.008665{col 37}{space 2} .0242673{col 48}{space 1}   -0.36{col 57}{space 3}1.000
{txt}Apr. 2015 vs Jan. 2015  {c |}{col 25}{res}{space 2}-.1195742{col 37}{space 2} .0911967{col 48}{space 1}   -1.31{col 57}{space 3}0.847
{txt}Mar. 2015 vs Feb. 2015  {c |}{col 25}{res}{space 2} .0067227{col 37}{space 2}  .026094{col 48}{space 1}    0.26{col 57}{space 3}1.000
{txt}Apr. 2015 vs Feb. 2015  {c |}{col 25}{res}{space 2}-.1041864{col 37}{space 2} .0916996{col 48}{space 1}   -1.14{col 57}{space 3}0.917
{txt}Apr. 2015 vs Mar. 2015  {c |}{col 25}{res}{space 2}-.1109092{col 37}{space 2} .0915186{col 48}{space 1}   -1.21{col 57}{space 3}0.890
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}

{com}. help pwmean

. pwmean stunted2, over(intdate) pveffects mcompare(bon)

{txt}Pairwise comparisons of means with equal variances

{txt}{p2colset 1 14 16 2}{...}
{p2col:over}:{space 1}{res:intdate}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 13}
{col 14}{c |}    Number of
{col 14}{c |}  Comparisons
{hline 13}{c +}{hline 13}
{space 5}intdate {c |}{col 14}{res}{space 1}          21
{txt}{hline 13}{c BT}{hline 13}

{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}
{col 25}{c |}{col 48}      Bon{col 57}ferroni
{col 1}               stunted2{col 25}{c |}   Contrast{col 37}   Std. Err.{col 49}      t{col 57}   P>|t|
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}
{space 16}intdate {c |}
{space 5}Nov. 2014 vs 1369  {c |}{col 25}{res}{space 2} .4277108{col 37}{space 2} .3423738{col 48}{space 1}    1.25{col 57}{space 3}1.000
{txt}{space 5}Dec. 2014 vs 1369  {c |}{col 25}{res}{space 2} .4063745{col 37}{space 2} .3421418{col 48}{space 1}    1.19{col 57}{space 3}1.000
{txt}{space 5}Jan. 2015 vs 1369  {c |}{col 25}{res}{space 2} .3609535{col 37}{space 2}  .342076{col 48}{space 1}    1.06{col 57}{space 3}1.000
{txt}{space 5}Feb. 2015 vs 1369  {c |}{col 25}{res}{space 2} .3455657{col 37}{space 2} .3422104{col 48}{space 1}    1.01{col 57}{space 3}1.000
{txt}{space 5}Mar. 2015 vs 1369  {c |}{col 25}{res}{space 2} .3522885{col 37}{space 2} .3421619{col 48}{space 1}    1.03{col 57}{space 3}1.000
{txt}{space 5}Apr. 2015 vs 1369  {c |}{col 25}{res}{space 2} .2413793{col 37}{space 2} .3532743{col 48}{space 1}    0.68{col 57}{space 3}1.000
{txt}Dec. 2014 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.0213363{col 37}{space 2} .0279101{col 48}{space 1}   -0.76{col 57}{space 3}1.000
{txt}Jan. 2015 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.0667574{col 37}{space 2}  .027091{col 48}{space 1}   -2.46{col 57}{space 3}0.289
{txt}Feb. 2015 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.0821451{col 37}{space 2} .0287387{col 48}{space 1}   -2.86{col 57}{space 3}0.090
{txt}Mar. 2015 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.0754224{col 37}{space 2} .0281556{col 48}{space 1}   -2.68{col 57}{space 3}0.156
{txt}Apr. 2015 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.1863315{col 37}{space 2} .0923075{col 48}{space 1}   -2.02{col 57}{space 3}0.916
{txt}Jan. 2015 vs Dec. 2014  {c |}{col 25}{res}{space 2} -.045421{col 37}{space 2}  .023982{col 48}{space 1}   -1.89{col 57}{space 3}1.000
{txt}Feb. 2015 vs Dec. 2014  {c |}{col 25}{res}{space 2}-.0608088{col 37}{space 2} .0258289{col 48}{space 1}   -2.35{col 57}{space 3}0.391
{txt}Mar. 2015 vs Dec. 2014  {c |}{col 25}{res}{space 2} -.054086{col 37}{space 2} .0251784{col 48}{space 1}   -2.15{col 57}{space 3}0.667
{txt}Apr. 2015 vs Dec. 2014  {c |}{col 25}{res}{space 2}-.1649952{col 37}{space 2} .0914433{col 48}{space 1}   -1.80{col 57}{space 3}1.000
{txt}Feb. 2015 vs Jan. 2015  {c |}{col 25}{res}{space 2}-.0153877{col 37}{space 2} .0249415{col 48}{space 1}   -0.62{col 57}{space 3}1.000
{txt}Mar. 2015 vs Jan. 2015  {c |}{col 25}{res}{space 2} -.008665{col 37}{space 2} .0242673{col 48}{space 1}   -0.36{col 57}{space 3}1.000
{txt}Apr. 2015 vs Jan. 2015  {c |}{col 25}{res}{space 2}-.1195742{col 37}{space 2} .0911967{col 48}{space 1}   -1.31{col 57}{space 3}1.000
{txt}Mar. 2015 vs Feb. 2015  {c |}{col 25}{res}{space 2} .0067227{col 37}{space 2}  .026094{col 48}{space 1}    0.26{col 57}{space 3}1.000
{txt}Apr. 2015 vs Feb. 2015  {c |}{col 25}{res}{space 2}-.1041864{col 37}{space 2} .0916996{col 48}{space 1}   -1.14{col 57}{space 3}1.000
{txt}Apr. 2015 vs Mar. 2015  {c |}{col 25}{res}{space 2}-.1109092{col 37}{space 2} .0915186{col 48}{space 1}   -1.21{col 57}{space 3}1.000
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}

{com}. pwmean stunted2 if eligChild ==1, over(intdate) pveffects mcompare(tukey)
{err}if not allowed
{txt}{search r(101), local:r(101);}

{com}. preserve
{err}already preserved
{txt}{search r(621), local:r(621);}

{com}. keep if eligChild == 1
{txt}(10,174 observations deleted)

{com}. br

. pwmean stunted2, over(intdate) pveffects mcompare(tukey)

{txt}Pairwise comparisons of means with equal variances

{txt}{p2colset 1 14 16 2}{...}
{p2col:over}:{space 1}{res:intdate}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 13}
{col 14}{c |}    Number of
{col 14}{c |}  Comparisons
{hline 13}{c +}{hline 13}
{space 5}intdate {c |}{col 14}{res}{space 1}          21
{txt}{hline 13}{c BT}{hline 13}

{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}
{col 25}{c |}{col 48}        T{col 57}ukey
{col 1}               stunted2{col 25}{c |}   Contrast{col 37}   Std. Err.{col 49}      t{col 57}   P>|t|
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}
{space 16}intdate {c |}
{space 5}Nov. 2014 vs 1369  {c |}{col 25}{res}{space 2} .4277108{col 37}{space 2} .3423738{col 48}{space 1}    1.25{col 57}{space 3}0.875
{txt}{space 5}Dec. 2014 vs 1369  {c |}{col 25}{res}{space 2} .4063745{col 37}{space 2} .3421418{col 48}{space 1}    1.19{col 57}{space 3}0.899
{txt}{space 5}Jan. 2015 vs 1369  {c |}{col 25}{res}{space 2} .3609535{col 37}{space 2}  .342076{col 48}{space 1}    1.06{col 57}{space 3}0.941
{txt}{space 5}Feb. 2015 vs 1369  {c |}{col 25}{res}{space 2} .3455657{col 37}{space 2} .3422104{col 48}{space 1}    1.01{col 57}{space 3}0.952
{txt}{space 5}Mar. 2015 vs 1369  {c |}{col 25}{res}{space 2} .3522885{col 37}{space 2} .3421619{col 48}{space 1}    1.03{col 57}{space 3}0.947
{txt}{space 5}Apr. 2015 vs 1369  {c |}{col 25}{res}{space 2} .2413793{col 37}{space 2} .3532743{col 48}{space 1}    0.68{col 57}{space 3}0.994
{txt}Dec. 2014 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.0213363{col 37}{space 2} .0279101{col 48}{space 1}   -0.76{col 57}{space 3}0.988
{txt}Jan. 2015 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.0667574{col 37}{space 2}  .027091{col 48}{space 1}   -2.46{col 57}{space 3}0.173
{txt}Feb. 2015 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.0821451{col 37}{space 2} .0287387{col 48}{space 1}   -2.86{col 57}{space 3}0.065
{txt}Mar. 2015 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.0754224{col 37}{space 2} .0281556{col 48}{space 1}   -2.68{col 57}{space 3}0.104
{txt}Apr. 2015 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.1863315{col 37}{space 2} .0923075{col 48}{space 1}   -2.02{col 57}{space 3}0.403
{txt}Jan. 2015 vs Dec. 2014  {c |}{col 25}{res}{space 2} -.045421{col 37}{space 2}  .023982{col 48}{space 1}   -1.89{col 57}{space 3}0.484
{txt}Feb. 2015 vs Dec. 2014  {c |}{col 25}{res}{space 2}-.0608088{col 37}{space 2} .0258289{col 48}{space 1}   -2.35{col 57}{space 3}0.219
{txt}Mar. 2015 vs Dec. 2014  {c |}{col 25}{res}{space 2} -.054086{col 37}{space 2} .0251784{col 48}{space 1}   -2.15{col 57}{space 3}0.325
{txt}Apr. 2015 vs Dec. 2014  {c |}{col 25}{res}{space 2}-.1649952{col 37}{space 2} .0914433{col 48}{space 1}   -1.80{col 57}{space 3}0.545
{txt}Feb. 2015 vs Jan. 2015  {c |}{col 25}{res}{space 2}-.0153877{col 37}{space 2} .0249415{col 48}{space 1}   -0.62{col 57}{space 3}0.996
{txt}Mar. 2015 vs Jan. 2015  {c |}{col 25}{res}{space 2} -.008665{col 37}{space 2} .0242673{col 48}{space 1}   -0.36{col 57}{space 3}1.000
{txt}Apr. 2015 vs Jan. 2015  {c |}{col 25}{res}{space 2}-.1195742{col 37}{space 2} .0911967{col 48}{space 1}   -1.31{col 57}{space 3}0.847
{txt}Mar. 2015 vs Feb. 2015  {c |}{col 25}{res}{space 2} .0067227{col 37}{space 2}  .026094{col 48}{space 1}    0.26{col 57}{space 3}1.000
{txt}Apr. 2015 vs Feb. 2015  {c |}{col 25}{res}{space 2}-.1041864{col 37}{space 2} .0916996{col 48}{space 1}   -1.14{col 57}{space 3}0.917
{txt}Apr. 2015 vs Mar. 2015  {c |}{col 25}{res}{space 2}-.1109092{col 37}{space 2} .0915186{col 48}{space 1}   -1.21{col 57}{space 3}0.890
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}

{com}. pwmean stunted2, over(intdate) pveffects mcompare(bon)

{txt}Pairwise comparisons of means with equal variances

{txt}{p2colset 1 14 16 2}{...}
{p2col:over}:{space 1}{res:intdate}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 13}
{col 14}{c |}    Number of
{col 14}{c |}  Comparisons
{hline 13}{c +}{hline 13}
{space 5}intdate {c |}{col 14}{res}{space 1}          21
{txt}{hline 13}{c BT}{hline 13}

{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}
{col 25}{c |}{col 48}      Bon{col 57}ferroni
{col 1}               stunted2{col 25}{c |}   Contrast{col 37}   Std. Err.{col 49}      t{col 57}   P>|t|
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}
{space 16}intdate {c |}
{space 5}Nov. 2014 vs 1369  {c |}{col 25}{res}{space 2} .4277108{col 37}{space 2} .3423738{col 48}{space 1}    1.25{col 57}{space 3}1.000
{txt}{space 5}Dec. 2014 vs 1369  {c |}{col 25}{res}{space 2} .4063745{col 37}{space 2} .3421418{col 48}{space 1}    1.19{col 57}{space 3}1.000
{txt}{space 5}Jan. 2015 vs 1369  {c |}{col 25}{res}{space 2} .3609535{col 37}{space 2}  .342076{col 48}{space 1}    1.06{col 57}{space 3}1.000
{txt}{space 5}Feb. 2015 vs 1369  {c |}{col 25}{res}{space 2} .3455657{col 37}{space 2} .3422104{col 48}{space 1}    1.01{col 57}{space 3}1.000
{txt}{space 5}Mar. 2015 vs 1369  {c |}{col 25}{res}{space 2} .3522885{col 37}{space 2} .3421619{col 48}{space 1}    1.03{col 57}{space 3}1.000
{txt}{space 5}Apr. 2015 vs 1369  {c |}{col 25}{res}{space 2} .2413793{col 37}{space 2} .3532743{col 48}{space 1}    0.68{col 57}{space 3}1.000
{txt}Dec. 2014 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.0213363{col 37}{space 2} .0279101{col 48}{space 1}   -0.76{col 57}{space 3}1.000
{txt}Jan. 2015 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.0667574{col 37}{space 2}  .027091{col 48}{space 1}   -2.46{col 57}{space 3}0.289
{txt}Feb. 2015 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.0821451{col 37}{space 2} .0287387{col 48}{space 1}   -2.86{col 57}{space 3}0.090
{txt}Mar. 2015 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.0754224{col 37}{space 2} .0281556{col 48}{space 1}   -2.68{col 57}{space 3}0.156
{txt}Apr. 2015 vs Nov. 2014  {c |}{col 25}{res}{space 2}-.1863315{col 37}{space 2} .0923075{col 48}{space 1}   -2.02{col 57}{space 3}0.916
{txt}Jan. 2015 vs Dec. 2014  {c |}{col 25}{res}{space 2} -.045421{col 37}{space 2}  .023982{col 48}{space 1}   -1.89{col 57}{space 3}1.000
{txt}Feb. 2015 vs Dec. 2014  {c |}{col 25}{res}{space 2}-.0608088{col 37}{space 2} .0258289{col 48}{space 1}   -2.35{col 57}{space 3}0.391
{txt}Mar. 2015 vs Dec. 2014  {c |}{col 25}{res}{space 2} -.054086{col 37}{space 2} .0251784{col 48}{space 1}   -2.15{col 57}{space 3}0.667
{txt}Apr. 2015 vs Dec. 2014  {c |}{col 25}{res}{space 2}-.1649952{col 37}{space 2} .0914433{col 48}{space 1}   -1.80{col 57}{space 3}1.000
{txt}Feb. 2015 vs Jan. 2015  {c |}{col 25}{res}{space 2}-.0153877{col 37}{space 2} .0249415{col 48}{space 1}   -0.62{col 57}{space 3}1.000
{txt}Mar. 2015 vs Jan. 2015  {c |}{col 25}{res}{space 2} -.008665{col 37}{space 2} .0242673{col 48}{space 1}   -0.36{col 57}{space 3}1.000
{txt}Apr. 2015 vs Jan. 2015  {c |}{col 25}{res}{space 2}-.1195742{col 37}{space 2} .0911967{col 48}{space 1}   -1.31{col 57}{space 3}1.000
{txt}Mar. 2015 vs Feb. 2015  {c |}{col 25}{res}{space 2} .0067227{col 37}{space 2}  .026094{col 48}{space 1}    0.26{col 57}{space 3}1.000
{txt}Apr. 2015 vs Feb. 2015  {c |}{col 25}{res}{space 2}-.1041864{col 37}{space 2} .0916996{col 48}{space 1}   -1.14{col 57}{space 3}1.000
{txt}Apr. 2015 vs Mar. 2015  {c |}{col 25}{res}{space 2}-.1109092{col 37}{space 2} .0915186{col 48}{space 1}   -1.21{col 57}{space 3}1.000
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}

{com}. di  .4314242 - .3429427
{res}.0884815

{com}. do "C:\Users\Tim\AppData\Local\Temp\STD02000000.tmp"
{txt}
{com}. svy:mean stunted2, over(motherBMI female)
{txt}(running mean on estimation sample)
{res}
{txt}Survey: Mean estimation

{col 1}Number of strata{col 18}= {res}     60{txt}{col 35}Number of obs{col 51}= {res}     3,532
{txt}{col 1}Number of PSUs{col 18}= {res}    491{txt}{col 35}Population size{col 51}={res} 3,562.1364
{txt}{col 35}Design df{col 51}= {res}       431

         {txt}Over: motherBMI female
    _subpop_1: {res}undernourished male
    {txt}_subpop_2: {res}undernourished female
    {txt}_subpop_3: {res}normal male
    {txt}_subpop_4: {res}normal female
    {txt}_subpop_5: {res}overweight male
    {txt}_subpop_6: {res}overweight female

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 26}  Linearized
{col 1}        Over{col 14}{c |}       Mean{col 26}   Std. Err.{col 38}     [95% Con{col 51}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{res}stunted2     {txt}{c |}
{space 3}_subpop_1 {c |}{col 14}{res}{space 2} .6000404{col 26}{space 2} .0586827{col 37}{space 5} .4847006{col 51}{space 3} .7153802
{txt}{space 3}_subpop_2 {c |}{col 14}{res}{space 2} .3815895{col 26}{space 2} .0546717{col 37}{space 5} .2741332{col 51}{space 3} .4890459
{txt}{space 3}_subpop_3 {c |}{col 14}{res}{space 2} .4402011{col 26}{space 2} .0160741{col 37}{space 5} .4086079{col 51}{space 3} .4717944
{txt}{space 3}_subpop_4 {c |}{col 14}{res}{space 2} .3574201{col 26}{space 2} .0148225{col 37}{space 5} .3282867{col 51}{space 3} .3865534
{txt}{space 3}_subpop_5 {c |}{col 14}{res}{space 2} .3436661{col 26}{space 2} .0247239{col 37}{space 5} .2950717{col 51}{space 3} .3922605
{txt}{space 3}_subpop_6 {c |}{col 14}{res}{space 2} .2316798{col 26}{space 2} .0202617{col 37}{space 5} .1918557{col 51}{space 3} .2715039
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\Tim\AppData\Local\Temp\STD02000000.tmp"
{txt}
{com}. mean stunted2, over(intdate)
{res}
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     3,538

    {txt}_subpop_1: intdate = {res}1369
    {txt}_subpop_2: intdate = {res}Nov. 2014
    {txt}_subpop_3: intdate = {res}Dec. 2014
    {txt}_subpop_4: intdate = {res}Jan. 2015
    {txt}_subpop_5: intdate = {res}Feb. 2015
    {txt}_subpop_6: intdate = {res}Mar. 2015
    {txt}_subpop_7: intdate = {res}Apr. 2015

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 1}        Over{col 14}{c |}       Mean{col 26}   Std. Err.{col 38}     [95% Con{col 51}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{res}stunted2     {txt}{c |}
{space 3}_subpop_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 3}_subpop_2 {c |}{col 14}{res}{space 2} .4277108{col 26}{space 2} .0221924{col 37}{space 5} .3841996{col 51}{space 3} .4712221
{txt}{space 3}_subpop_3 {c |}{col 14}{res}{space 2} .4063745{col 26}{space 2} .0179106{col 37}{space 5} .3712583{col 51}{space 3} .4414907
{txt}{space 3}_subpop_4 {c |}{col 14}{res}{space 2} .3609535{col 26}{space 2} .0161901{col 37}{space 5} .3292105{col 51}{space 3} .3926964
{txt}{space 3}_subpop_5 {c |}{col 14}{res}{space 2} .3455657{col 26}{space 2} .0186098{col 37}{space 5} .3090787{col 51}{space 3} .3820528
{txt}{space 3}_subpop_6 {c |}{col 14}{res}{space 2} .3522885{col 26}{space 2} .0178022{col 37}{space 5} .3173849{col 51}{space 3} .3871921
{txt}{space 3}_subpop_7 {c |}{col 14}{res}{space 2} .2413793{col 26}{space 2} .0808692{col 37}{space 5} .0828243{col 51}{space 3} .3999344
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. matrix plot = r(table)'
{txt}
{com}. matsort plot 1 "down"
{txt}
{com}. matrix plot = plot'
{txt}
{com}. coefplot (matrix(plot[1,])), ci((plot[5,] plot[6,]))
{res}{txt}(plot: CI1 missing for some coefficients)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. help pwmean

. 